Reports/ОжидаемыйИПодтвержденныйНДСПриобретений.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Report>
		<Properties>
			<Name>ОжидаемыйИПодтвержденныйНДСПриобретений</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>УниверсальныйОтчет</Name>
					<Type>
						<v8:Type>cfg:ReportObject.УниверсальныйОтчет</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Report>
</MetaDataObject>

AccumulationRegisters/ОжидаемыйИПодтвержденныйНДСПриобретений.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<AccumulationRegister>
		<Properties>
			<Name>ОжидаемыйИПодтвержденныйНДСПриобретений</Name>
			<Comment>(Регл) </Comment>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>БазаНДС</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаНДС</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаНДСПропорционально</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>КодОперации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.КодыОперацийОжидаемыйИПодтвержденныйНДСПриобретений</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДоговорКонтрагента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Сделка</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:DocumentRef.ВозвратТоваровОтПокупателя</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаказПокупателя</v8:Type>
						<v8:Type>cfg:DocumentRef.ПередачаОС</v8:Type>
						<v8:Type>cfg:DocumentRef.РеализацияУслугПоПереработке</v8:Type>
						<v8:Type>cfg:DocumentRef.ПриходныйКассовыйОрдер</v8:Type>
						<v8:Type>cfg:DocumentRef.ПлатежноеПоручениеИсходящее</v8:Type>
						<v8:Type>cfg:DocumentRef.РасходныйКассовыйОрдер</v8:Type>
						<v8:Type>cfg:DocumentRef.ПоступлениеИзПереработки</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаказПоставщику</v8:Type>
						<v8:Type>cfg:DocumentRef.ДокументРасчетовСКонтрагентом</v8:Type>
						<v8:Type>cfg:DocumentRef.ПоступлениеТоваровУслугВНТТ</v8:Type>
						<v8:Type>cfg:DocumentRef.ПередачаНМА</v8:Type>
						<v8:Type>cfg:DocumentRef.ОтчетКомитентуОПродажах</v8:Type>
						<v8:Type>cfg:DocumentRef.ПлатежныйОрдерСписаниеДенежныхСредств</v8:Type>
						<v8:Type>cfg:DocumentRef.АктОбОказанииПроизводственныхУслуг</v8:Type>
						<v8:Type>cfg:DocumentRef.ПоступлениеНМА</v8:Type>
						<v8:Type>cfg:DocumentRef.КорректировкаДолгаПоВозвратнойТаре</v8:Type>
						<v8:Type>cfg:DocumentRef.СчетНаОплатуПокупателю</v8:Type>
						<v8:Type>cfg:DocumentRef.ВозвратТоваровПоставщику</v8:Type>
						<v8:Type>cfg:DocumentRef.ПоступлениеДопРасходов</v8:Type>
						<v8:Type>cfg:DocumentRef.ПлатежноеПоручениеВходящее</v8:Type>
						<v8:Type>cfg:DocumentRef.ГТДИмпорт</v8:Type>
						<v8:Type>cfg:DocumentRef.ПоступлениеТоваровУслуг</v8:Type>
						<v8:Type>cfg:DocumentRef.СчетНаОплатуПоставщика</v8:Type>
						<v8:Type>cfg:DocumentRef.ПлатежныйОрдерПоступлениеДенежныхСредств</v8:Type>
						<v8:Type>cfg:DocumentRef.ОтчетКомиссионераОПродажах</v8:Type>
						<v8:Type>cfg:DocumentRef.ВозвратТоваровПоставщикуИзНТТ</v8:Type>
						<v8:Type>cfg:DocumentRef.РеализацияТоваровУслуг</v8:Type>
						<v8:Type>cfg:DocumentRef.АвансовыйОтчет</v8:Type>
						<v8:Type>cfg:DocumentRef.КорректировкаДолга</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВозвратнаяТара</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СобытиеНДС</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СобытияОжидаемыйИПодтвержденныйНДСПриобретений</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СтавкаНДС</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтавкиНДС</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДляХозяйственнойДеятельности</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидДеятельностиНДС</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыДеятельностиНДС</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Амортизируется</Name>
					<Comment>Поставка Основных фондов. Исользуется для запонения Приложения 5 к Декларации по НДС (с 2008 г)</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

Enums/ВидыДеятельностиНДС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Enum>
		<Properties>
			<Name>ВидыДеятельностиНДС</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Облагаемая</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Необлагаемая</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПропорциональноОблагаемая</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Reports/ОжидаемыйИПодтвержденныйНДСПриобретений/Ext/ObjectModule.bsl
#Если Клиент Тогда
	
////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ НАЧАЛЬНОЙ НАСТРОЙКИ ОТЧЕТА

// Процедура установки начальных настроек отчета по метаданным регистра накопления
//
Процедура УстановитьНачальныеНастройки(ДополнительныеПараметры = Неопределено) Экспорт
	
	// Настройка общих параметров универсального отчета
	
	// Содержит название отчета, которое будет выводиться в шапке.
	// Тип: Строка.
	// Пример:
	// УниверсальныйОтчет.мНазваниеОтчета = "Название отчета";
	УниверсальныйОтчет.мНазваниеОтчета = СокрЛП(ЭтотОбъект.Метаданные().Синоним);
	
	// Содержит признак необходимости отображения надписи и поля выбора раздела учета в форме настройки.
	// Тип: Булево.
	// Значение по умолчанию: Истина.
	// Пример:
	// УниверсальныйОтчет.мВыбиратьИмяРегистра = Ложь;
	УниверсальныйОтчет.мВыбиратьИмяРегистра = Ложь;
	
	// Содержит имя регистра, по метаданным которого будет выполняться заполнение настроек отчета.
	// Тип: Строка.
	// Пример:
	// УниверсальныйОтчет.ИмяРегистра = "ТоварыНаСкладах";
	УниверсальныйОтчет.ИмяРегистра = "ОжидаемыйИПодтвержденныйНДСПриобретений";
	
	// Содержит признак необходимости вывода отрицательных значений показателей красным цветом.
	// Тип: Булево.
	// Значение по умолчанию: Ложь.
	// Пример:
	// УниверсальныйОтчет.ОтрицательноеКрасным = Истина;
	
	// Содержит признак необходимости вывода в отчет общих итогов.
	// Тип: Булево.
	// Значение по умолчанию: Истина.
	// Пример:
	УниверсальныйОтчет.ВыводитьОбщиеИтоги = Ложь;
	
	// Содержит признак необходимости вывода детальных записей в отчет.
	// Тип: Булево.
	// Значение по умолчанию: Ложь.
	// Пример:
	// УниверсальныйОтчет.ВыводитьДетальныеЗаписи = Истина;
	
	// Содержит признак необходимости отображения флага использования свойств и категорий в форме настройки.
	// Тип: Булево.
	// Значение по умолчанию: Истина.
	// Пример:
	УниверсальныйОтчет.мВыбиратьИспользованиеСвойств = Ложь;
	
	// Содержит признак использования свойств и категорий при заполнении настроек отчета.
	// Тип: Булево.
	// Значение по умолчанию: Ложь.
	// Пример:
	// УниверсальныйОтчет.ИспользоватьСвойстваИКатегории = Истина;
	
	// Содержит признак использования простой формы настроек отчета без группировок колонок.
	// Тип: Булево.
	// Значение по умолчанию: Ложь.
	// Пример:
	// УниверсальныйОтчет.мРежимФормыНастройкиБезГруппировокКолонок = Истина;
	
	// Дополнительные параметры, переданные из отчета, вызвавшего расшифровку.
	// Информация, передаваемая в переменной ДополнительныеПараметры, может быть использована
	// для реализации специфичных для данного отчета параметрических настроек.
	
	
	// Описание исходного текста запроса.
	
    ТекстЗапроса = 
		  "ВЫБРАТЬ РАЗРЕШЕННЫЕ
		  |	НДС.Организация КАК Организация,
		  |	ВЫБОР
		  |		КОГДА НДС.ДоговорКонтрагента = ЗНАЧЕНИЕ(Справочник.ДоговорыКонтрагентов.ПустаяСсылка)
		  |				ИЛИ НДС.ДоговорКонтрагента.Внешнеэкономический = ЛОЖЬ
		  |			ТОГДА &Гривна
		  |		ИНАЧЕ НДС.ДоговорКонтрагента.ВалютаВзаиморасчетов
		  |	КОНЕЦ КАК Валюта,
		  |	НДС.ДоговорКонтрагента.Владелец КАК Контрагент,
		  |	НДС.ДоговорКонтрагента КАК ДоговорКонтрагента,
		  |	ВЫБОР
		  |		КОГДА НДС.ВозвратнаяТара = ИСТИНА
		  |			ТОГДА ""Возвратная тара""
		  |		ИНАЧЕ ""Товары""
		  |	КОНЕЦ КАК ВозвратнаяТара,
		  |	НДС.СобытиеНДС КАК СобытиеНДС,
		  |	НДС.СтавкаНДС КАК СтавкаНДС,
		  |	НДС.Сделка КАК Сделка,
		  |	ВЫБОР
		  |		КОГДА НДС.ДляХозяйственнойДеятельности = ИСТИНА
		  |			ТОГДА ""Для хоз. деят.""
		  |		ИНАЧЕ ""Для не хоз. деят.""
		  |	КОНЕЦ КАК ДляХозяйственнойДеятельности,
		  |	ВЫБОР
		  |		КОГДА НДС.ВидДеятельностиНДС = &ОблагаемыйВидДеятельностиНДС
		  |			ТОГДА ""Для обл. НДС""
		  |		КОГДА НДС.ВидДеятельностиНДС = &ПропорциональныйВидДеятельностиНДС
		  |			ТОГДА ""Пропорц. НДС""
		  |		ИНАЧЕ ""Для не обл. НДС""
		  |	КОНЕЦ КАК ДляОперацийОблагаемыхНДС,
		  |	ВЫБОР
		  |		КОГДА НДС.Амортизируется
		  |			ТОГДА ""Амортизируется""
		  |		ИНАЧЕ ""Не амортизируется""
		  |	КОНЕЦ КАК Амортизируется,
		  |	ВЫБОР
		  |		КОГДА НДС.ВидДвижения = &Приход
		  |			ТОГДА НДС.БазаНДС
		  |		ИНАЧЕ 0
		  |	КОНЕЦ КАК ОжидаемыйБазаНДС,
		  |	ВЫБОР
		  |		КОГДА НДС.ВидДвижения = &Приход
		  |			ТОГДА НДС.СуммаНДС
		  |		ИНАЧЕ 0
		  |	КОНЕЦ КАК ОжидаемыйСуммаНДС,
		  |	ВЫБОР
		  |		КОГДА НДС.ВидДвижения = &Приход
		  |			ТОГДА НДС.СуммаНДСПропорционально
		  |		ИНАЧЕ 0
		  |	КОНЕЦ КАК ОжидаемыйСуммаНДСПропорционально,
		  |	ВЫБОР
		  |		КОГДА (НЕ НДС.ВидДвижения = &Приход)
		  |			ТОГДА НДС.БазаНДС
		  |		ИНАЧЕ 0
		  |	КОНЕЦ КАК ПодтвержденныйБазаНДС,
		  |	ВЫБОР
		  |		КОГДА (НЕ НДС.ВидДвижения = &Приход)
		  |			ТОГДА НДС.СуммаНДС
		  |		ИНАЧЕ 0
		  |	КОНЕЦ КАК ПодтвержденныйСуммаНДС,
		  |	ВЫБОР
		  |		КОГДА (НЕ НДС.ВидДвижения = &Приход)
		  |			ТОГДА НДС.СуммаНДСПропорционально
		  |		ИНАЧЕ 0
		  |	КОНЕЦ КАК ПодтвержденныйСуммаНДСПропорционально,
		  |	ВЫБОР
		  |		КОГДА НДС.ВидДвижения = &Приход
		  |			ТОГДА НДС.БазаНДС
		  |		ИНАЧЕ -НДС.БазаНДС
		  |	КОНЕЦ КАК НеПодтвержденныйБазаНДС,
		  |	ВЫБОР
		  |		КОГДА НДС.ВидДвижения = &Приход
		  |			ТОГДА НДС.СуммаНДС
		  |		ИНАЧЕ -НДС.СуммаНДС
		  |	КОНЕЦ КАК НеПодтвержденныйСуммаНДС,
		  |	ВЫБОР
		  |		КОГДА НДС.ВидДвижения = &Приход
		  |			ТОГДА НДС.СуммаНДСПропорционально
		  |		ИНАЧЕ -НДС.СуммаНДСПропорционально
		  |	КОНЕЦ КАК НеПодтвержденныйСуммаНДСПропорционально
		  |{ВЫБРАТЬ
		  |	Организация.*,
		  |	НДС.ДоговорКонтрагента.Владелец.* КАК Контрагент,
		  |	ДоговорКонтрагента.*,
		  |	НДС.Сделка.*,
		  
		  |	ОжидаемыйБазаНДС,
		  |	ОжидаемыйСуммаНДС,
		  |	ПодтвержденныйБазаНДС,
		  |	ПодтвержденныйСуммаНДС,
		  |	НеПодтвержденныйБазаНДС,
		  |	НеПодтвержденныйСуммаНДС,
		  |	ОжидаемыйСуммаНДСПропорционально,
		  |	ПодтвержденныйСуммаНДСПропорционально,
		  |	НеПодтвержденныйСуммаНДСПропорционально
		  |}
		  |ИЗ
		  |	РегистрНакопления.ОжидаемыйИПодтвержденныйНДСПриобретений КАК НДС
		  |ГДЕ
		  |	НДС.Период >= &ДатаНачала
		  |	И НДС.Период <= &ДатаКонца
		  | И НДС.Активность = Истина
		  |
		  |{ГДЕ
		  |	НДС.Организация.*,
		  |	НДС.ДоговорКонтрагента.Владелец.* КАК Контрагент,
		  |	НДС.ДоговорКонтрагента.*,
		  |	НДС.ВозвратнаяТара КАК ВозвратнаяТара,
		  |	НДС.СобытиеНДС,
		  |	НДС.СтавкаНДС,
		  |	НДС.Сделка.*,
		  |	НДС.ДляХозяйственнойДеятельности КАК ДляХозяйственнойДеятельности,
		  |	НДС.Амортизируется КАК Амортизируется,
		  |	НДС.ВидДеятельностиНДС КАК ДляОперацийОблагаемыхНДС,
		  |	(ВЫБОР
		  |			КОГДА НДС.ДоговорКонтрагента = ЗНАЧЕНИЕ(Справочник.ДоговорыКонтрагентов.ПустаяСсылка)
		  |					ИЛИ НДС.ДоговорКонтрагента.Внешнеэкономический = ЛОЖЬ
		  |				ТОГДА &Гривна
		  |			ИНАЧЕ НДС.ДоговорКонтрагента.ВалютаВзаиморасчетов
		  |		КОНЕЦ).* КАК Валюта}
		  |
		  |УПОРЯДОЧИТЬ ПО
		  |	СобытиеНДС УБЫВ
		  |{УПОРЯДОЧИТЬ ПО
		  |	СобытиеНДС,
		  |	Организация.*,
		  |	Контрагент.*,
		  |	ДоговорКонтрагента.*}
		  |ИТОГИ
		  |	СУММА(ОжидаемыйБазаНДС),
		  |	СУММА(ОжидаемыйСуммаНДС),
		  |	СУММА(ПодтвержденныйБазаНДС),
		  |	СУММА(ПодтвержденныйСуммаНДС),
		  |	СУММА(НеПодтвержденныйБазаНДС),
		  |	СУММА(НеПодтвержденныйСуммаНДС),
		  |	СУММА(ОжидаемыйСуммаНДСПропорционально),
		  |	СУММА(ПодтвержденныйСуммаНДСПропорционально),
		  |	СУММА(НеПодтвержденныйСуммаНДСПропорционально)
		  |ПО
		  |	ОБЩИЕ,
		  |	Организация,
		  |	Валюта,
		  |	Контрагент,
		  |	ДоговорКонтрагента,
		  |	Сделка,
		  |	ВозвратнаяТара,
		  |	СтавкаНДС,
		  |	ДляХозяйственнойДеятельности,
		  |	ДляОперацийОблагаемыхНДС,
		  |	Амортизируется
		  |{ИТОГИ ПО
		  |	Организация,
		  |	Валюта,
		  |	НДС.ДоговорКонтрагента.Владелец.* КАК Контрагент,
		  |	ДоговорКонтрагента.*,
		  |	(ВЫБОР
		  |			КОГДА НДС.ВозвратнаяТара = ИСТИНА
		  |				ТОГДА ""Возвратная тара""
		  |			ИНАЧЕ ""Товары""
		  |		КОНЕЦ) КАК ВозвратнаяТара,
		  |	НДС.СобытиеНДС,
		  |	НДС.СтавкаНДС,
		  |	НДС.Сделка.*,
		  |	(ВЫБОР
		  |			КОГДА НДС.ДляХозяйственнойДеятельности = ИСТИНА
		  |				ТОГДА ""Для хоз. деят.""
		  |			ИНАЧЕ ""Для не хоз. деят.""
		  |		КОНЕЦ) КАК ДляХозяйственнойДеятельности,
		  |	(ВЫБОР
		  |			КОГДА НДС.ВидДеятельностиНДС = &ОблагаемыйВидДеятельностиНДС
		  |				ТОГДА ""Для обл. НДС""
		  |		КОГДА НДС.ВидДеятельностиНДС = &ПропорциональныйВидДеятельностиНДС
		  |			ТОГДА ""Пропорц. НДС""
		  |			ИНАЧЕ ""Для не обл. НДС""
		  |		КОНЕЦ) КАК ДляОперацийОблагаемыхНДС,
		  |	(ВЫБОР
		  |			КОГДА НДС.Амортизируется
		  |				ТОГДА ""Амортизируется""
		  |			ИНАЧЕ ""Не амортизируется""
		  |		КОНЕЦ) КАК Амортизируется}";

		  
	Если ЛокализацияПовтИсп.ПолучитьЯзыкФормированияПечатныхФормОтчетов() = "uk" Тогда
		
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, """Для хоз. деят.""", """Для госп. діял.""");
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, """Для не хоз. деят.""", """Для не госп. діял.""");
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, """Для не обл. НДС""", """Для неопод. ПДВ""");
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, """Пропорц. НДС""", """Пропорц.ПДВ""");
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, """Для обл. НДС""", """Для опод. ПДВ""");
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, """Амортизируется""", """Амортизується""");
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, """Не амортизируется""", """Не амортизується""");
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, """Возвратная тара""", """Поворотна тара""");
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, """Товары""", """Товари""");
		
	КонецЕсли;
	// Инициализация текста запроса построителя отчета
	УниверсальныйОтчет.ПостроительОтчета.Текст = ТекстЗапроса;
	
	// Представления полей отчета.
	// Необходимо вызывать для каждого поля запроса.
	// УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить(<ИмяПоля>, <ПредставлениеПоля>);
	УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить("ДоговорКонтрагента",		 	НСтр("ru='Договор';uk='Договір'"));
	УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить("Контрагент",	 				НСтр("ru='Контрагент';uk='Контрагент'"));
	УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить("ВозвратнаяТара", 				НСтр("ru='За тару';uk='За тару'"));
	УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить("СобытиеНДС", 					НСтр("ru='Поступление/возврат';uk='Надходження/повернення'"));
	УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить("Сделка", 						НСтр("ru='Сделка';uk='Угода'"));
	УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить("СтавкаНДС", 					НСтр("ru='Ставка НДС';uk='Ставка ПДВ'"));
	УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить("ДляХозяйственнойДеятельности",НСтр("ru='Хоз. деятельность';uk='Госп. діяльність'"));
	УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить("ДляОперацийОблагаемыхНДС", 	НСтр("ru='Облаг. НДС деятельность';uk='Оподатк. ПДВ діяльність'"));
	УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить("Амортизируется", 				НСтр("ru='Амортизируется';uk='Амортизується'"));
	УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить("Организация",		 			НСтр("ru='Организация';uk='Організація'"));
	УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить("Валюта",		 			    НСтр("ru='Валюта';uk='Валюта'"));
	
	// Добавление показателей
	// Необходимо вызывать для каждого добавляемого показателя.
	// УниверсальныйОтчет.ДобавитьПоказатель(<ИмяПоказателя>, <ПредставлениеПоказателя>, <ВключенПоУмолчанию>, <Формат>, <ИмяГруппы>, <ПредставлениеГруппы>);
	
	УниверсальныйОтчет.ДобавитьПоказатель("ОжидаемыйБазаНДС", 			НСтр("ru='База НДС';uk='База ПДВ'"), Истина, "ЧЦ=15; ЧДЦ=2","ОжидаемыйНДС", НСтр("ru='Ожидаемый НДС';uk='Очікуваний ПДВ'"));
	УниверсальныйОтчет.ДобавитьПоказатель("ОжидаемыйСуммаНДС", 			НСтр("ru='НДС';uk='ПДВ'"), 		Истина, "ЧЦ=15; ЧДЦ=2","ОжидаемыйНДС");
	УниверсальныйОтчет.ДобавитьПоказатель("ПодтвержденныйБазаНДС", 		НСтр("ru='База НДС';uk='База ПДВ'"), Истина, "ЧЦ=15; ЧДЦ=2","ПодтвержденныйНДС", НСтр("ru='Подтвержденный НДС';uk='Підтверджений ПДВ'"));
	УниверсальныйОтчет.ДобавитьПоказатель("ПодтвержденныйСуммаНДС", 	НСтр("ru='НДС';uk='ПДВ'"), 		Истина, "ЧЦ=15; ЧДЦ=2","ПодтвержденныйНДС");
	УниверсальныйОтчет.ДобавитьПоказатель("НеПодтвержденныйБазаНДС", 	НСтр("ru='База НДС';uk='База ПДВ'"), Истина, "ЧЦ=15; ЧДЦ=2","НеПодтвержденныйНДС", НСтр("ru='Не подтвержденный НДС';uk='Не підтверджений ПДВ'"));
	УниверсальныйОтчет.ДобавитьПоказатель("НеПодтвержденныйСуммаНДС", 	НСтр("ru='НДС';uk='ПДВ'"), 		Истина, "ЧЦ=15; ЧДЦ=2","НеПодтвержденныйНДС");
	
	УниверсальныйОтчет.ДобавитьПоказатель("ОжидаемыйСуммаНДСПропорционально", 			НСтр("ru='НДС (пропорц.)';uk='ПДВ (пропорц.)'"), 		Ложь, "ЧЦ=15; ЧДЦ=2","ОжидаемыйНДС");
	УниверсальныйОтчет.ДобавитьПоказатель("ПодтвержденныйСуммаНДСПропорционально", 	    НСтр("ru='НДС (пропорц.)';uk='ПДВ (пропорц.)'"), 		Ложь, "ЧЦ=15; ЧДЦ=2","ПодтвержденныйНДС");
	УниверсальныйОтчет.ДобавитьПоказатель("НеПодтвержденныйСуммаНДСПропорционально", 	НСтр("ru='НДС (пропорц.)';uk='ПДВ (пропорц.)'"), 		Ложь, "ЧЦ=15; ЧДЦ=2","НеПодтвержденныйНДС");
	
	// Добавление предопределенных группировок строк отчета.
	// Необходимо вызывать для каждой добавляемой группировки строки.
	// УниверсальныйОтчет.ДобавитьИзмерениеСтроки(<ПутьКДанным>);
	
	// Добавление предопределенных группировок колонок отчета.
	// Необходимо вызывать для каждой добавляемой группировки колонки.
	 УниверсальныйОтчет.ДобавитьИзмерениеКолонки("СобытиеНДС");
	
	// Добавление предопределенных отборов отчета.
	// Необходимо вызывать для каждого добавляемого отбора.
	// УниверсальныйОтчет.ДобавитьОтбор(<ПутьКДанным>);
	УниверсальныйОтчет.ДобавитьОтбор("Организация");
	УниверсальныйОтчет.ДобавитьОтбор("Контрагент");
	УниверсальныйОтчет.ДобавитьОтбор("СобытиеНДС");
	
	// Добавление предопределенных полей порядка отчета.
	// Необходимо вызывать для каждого добавляемого поля порядка.
	// УниверсальныйОтчет.ДобавитьПорядок(<ПутьКДанным>);
	
	// Установка связи подчиненных и родительских полей
	// УниверсальныйОтчет.УстановитьСвязьПолей(<ПутьКДанным>, <ПутьКДаннымРодитель>);
	 
	// Установка связи полей и измерений
	// УниверсальныйОтчет.УстановитьСвязьПоляИИзмерения(<ИмяПоля>, <ИмяИзмерения>);
	
	// Установка представлений полей
	УниверсальныйОтчет.УстановитьПредставленияПолей(УниверсальныйОтчет.мСтруктураПредставлениеПолей, УниверсальныйОтчет.ПостроительОтчета);
	
	// Установка типов значений свойств в отборах отчета
	УниверсальныйОтчет.УстановитьТипыЗначенийСвойствДляОтбора();
	
	// Заполнение начальных настроек универсального отчета
	УниверсальныйОтчет.УстановитьНачальныеНастройки(Ложь);
	
	// Добавление дополнительных полей
	// Необходимо вызывать для каждого добавляемого дополнительного поля.
	// УниверсальныйОтчет.ДобавитьДополнительноеПоле(<ПутьКДанным>, <Размещение>, <Положение>);
	
КонецПроцедуры // УстановитьНачальныеНастройки()

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ФОРМИРОВАНИЯ ОТЧЕТА 
	
// Процедура формирования отчета
//
Процедура СформироватьОтчет(ТабличныйДокумент) Экспорт
	
	// Перед формирование отчета можно установить необходимые параметры универсального отчета.
	
	УниверсальныйОтчет.ПостроительОтчета.Параметры.Вставить("Приход", 						ВидДвиженияНакопления.Приход);
	УниверсальныйОтчет.ПостроительОтчета.Параметры.Вставить("ОблагаемыйВидДеятельностиНДС",Перечисления.ВидыДеятельностиНДС.Облагаемая);
	УниверсальныйОтчет.ПостроительОтчета.Параметры.Вставить("ПропорциональныйВидДеятельностиНДС",Перечисления.ВидыДеятельностиНДС.ПропорциональноОблагаемая);
	УниверсальныйОтчет.ПостроительОтчета.Параметры.Вставить("Гривна",  					глЗначениеПеременной("ВалютаРегламентированногоУчета"));
	
	УниверсальныйОтчет.СформироватьОтчет(ТабличныйДокумент);
	
КонецПроцедуры // СформироватьОтчет()

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ОБЩЕГО НАЗНАЧЕНИЯ

// Процедура обработки расшифровки
//
Процедура ОбработкаРасшифровки(Расшифровка, Объект) Экспорт
	
	// Дополнительные параметры в расшифровывающий отчет можно передать
	// посредством инициализации переменной "ДополнительныеПараметры".
	
	ДополнительныеПараметры = Неопределено;
	УниверсальныйОтчет.ОбработкаРасшифровкиУниверсальногоОтчета(Расшифровка, Объект, ДополнительныеПараметры);
	
КонецПроцедуры // ОбработкаРасшифровки()

// Формирует структуру для сохранения настроек отчета
//
Процедура СформироватьСтруктуруДляСохраненияНастроек(СтруктураСНастройками) Экспорт
	
	УниверсальныйОтчет.СформироватьСтруктуруДляСохраненияНастроек(СтруктураСНастройками);
	
КонецПроцедуры // СформироватьСтруктуруДляСохраненияНастроек()

// Заполняет настройки отчета из структуры сохраненных настроек
//
Функция ВосстановитьНастройкиИзСтруктуры(СтруктураСНастройками) Экспорт
	
	Возврат УниверсальныйОтчет.ВосстановитьНастройкиИзСтруктуры(СтруктураСНастройками, ЭтотОбъект);
	
КонецФункции // ВосстановитьНастройкиИзСтруктуры()

// Содержит значение используемого режима ввода периода.
// Тип: Число.
// Возможные значения: 0 - произвольный период, 1 - на дату, 2 - неделя, 3 - декада, 4 - месяц, 5 - квартал, 6 - полугодие, 7 - год
// Значение по умолчанию: 0
// Пример:
УниверсальныйОтчет.мРежимВводаПериода = 4;

#КонецЕсли
